unitTests/Foam2Eigen/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
9
(
(0.80093626 0.16845964 0.72741327)
(0.82078459 0.29191422 0.99396549)
(0.86606836 0.6883854  0.0463758 )
(0.35404089 0.32368873 0.64384439)
(0.80305602 0.93725668 0.82662493)
(0.28995787 0.86748605 0.1556299 )
(0.26138227 0.90689398 0.45691658)
(0.22674645 0.66441032 0.93668346)
(0.54623615 0.71569204 0.54570119)
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    fixedWalls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
